[Infiltrator X2SoldierClassTemplate]
+DisplayName="Infiltrator"
+ClassSummary="Infiltrators are specialists in close combat, infiltration and counter tactics. High accuracy, mobility and stealth make them a key asset of every guerilla operation."
+LeftAbilityTreeTitle="Hitman"
+RightAbilityTreeTitle="Stalker"

+RandomNickNames[0]="Trojan"
+RandomNickNames[1]="Spartan"
+RandomNickNames[2]="Prowler"
+RandomNickNames[3]="Asset"
+RandomNickNames[4]="Wildcard"
+RandomNickNames[5]="Ace"
+RandomNickNames[6]="Dagger"
+RandomNickNames[7]="Dice"
+RandomNickNames[8]="Overlord"
+RandomNickNames[9]="Stalker"
+RandomNickNames[10]="Deadeye"
+RandomNickNames[11]="Dust"
+RandomNickNames[12]="Hotshot"
+RandomNickNames[13]="Nimble"
+RandomNickNames[14]="Slicewire"
+RandomNickNames[15]="Bladerunner"
+RandomNickNames[16]="Serial"
+RandomNickNames[17]="Coldblooded"
+RandomNickNames[18]="Red"
+RandomNickNames[19]="Ferryman"
+RandomNickNames[20]="Oblivion"
+RandomNickNames[21]="Darkness"
+RandomNickNames[22]="Reaper"
+RandomNickNames[23]="Santa Muerte"
+RandomNickNames[24]="Pale"
+RandomNickNames[25]="Hades"
+RandomNickNames[26]="Azrail"
+RandomNickNames[27]="Seeker"
+RandomNickNames[28]="Wild Hunt"
+RandomNickNames[29]="Ezekiel"

[MusashiSwordSlice X2AbilityTemplate]
LocFriendlyName="Fleche"
LocFlyOverText="Fleche"
LocLongDescription="Attack any enemy within movement range with your sword. Deals +1 damage for every <Ability:FLECHE_BONUS_DAMAGE_PER_TILES/> tiles between your starting position and the target."
LocHelpText="Attack any enemy within movement range with your sword. Deals bonus damage for attacks from a distance."
LocPromotionPopupText="<Bullet/> You can trigger the Fleche ability by placing the movement cursor over an enemy.<br/><Bullet/> A soldier can perform a \"Dash\" move, using both actions to move, and still trigger an attack against an adjacent enemy.<br/><Bullet/> Fleche deals 1 bonus damage for every <Ability:FLECHE_BONUS_DAMAGE_PER_TILES/> tiles between unit's position at the start of its turn and the target's position.<br/>"

[MusashiFleche X2AbilityTemplate]
LocFriendlyName="Fleche"
LocFlyOverText="Fleche"
LocLongDescription="Attack any enemy within movement range with your sword. Deals +1 damage for every <Ability:FLECHE_BONUS_DAMAGE_PER_TILES/> tiles between your starting position and the target."
LocHelpText="Attack any enemy within movement range with your sword. Deals bonus damage for attacks from a distance."
LocPromotionPopupText="<Bullet/> You can trigger the Fleche ability by placing the movement cursor over an enemy.<br/><Bullet/> A soldier can perform a \"Dash\" move, using both actions to move, and still trigger an attack against an adjacent enemy.<br/><Bullet/>  Fleche deals 1 bonus damage for every <Ability:FLECHE_BONUS_DAMAGE_PER_TILES/> tiles between unit's position at the start of its turn and the target's position.<br/>"

[MusashiSlash X2AbilityTemplate]
LocFriendlyName="Slash"
LocFlyOverText="Slash"
LocLongDescription="Attack an adjacent target with your melee weapon. Uses one action."
LocHelpText="Attack an adjacent target with your melee weapon. Uses one action."
LocPromotionPopupText="<Bullet/> Attack an adjacent target with your melee weapon.<br/><Bullet/> Uses one action and doesn't automatically end your turn, so two attacks a turn are possible."

[MusashiRaiseTheStakes X2AbilityTemplate]
LocFriendlyName="Raise The Stakes"
LocLongDescription="Reload your primary weapon for free whenever you make a kill."
LocHelpText="Free Reload on Kill"
LocFlyOverText="Raising The Stakes!"
LocPromotionPopupText="<Bullet/> Reloads the primary weapon immediately after each kill.<br/><Bullet/> Costs no action, also triggers on kills not made with the primary weapon."

[MusashiStealthTactics X2AbilityTemplate]
LocFriendlyName="Stealth Tactics"
LocLongDescription="If you see no visible enemy for 1 rounds you enter concealment."
LocHelpText="<Bullet/>If you see no visible enemy for 1 rounds you enter concealment."
LocFlyOverText="StealthTactics" 
LocPromotionPopupText="If you see no visible enemy for 1 rounds you enter concealment."

[MusashiRecon X2AbilityTemplate]
LocFriendlyName="Recon"
LocLongDescription="Your soldier is a recon specialist behind enemy lines. 30% less detection radius and +2 sight radius."
LocHelpText="30% less detection radius and +2 sight radius."
LocFlyOverText="Recon"
LocPromotionPopupText="<Bullet/>Your soldier is a recon specialist behind enemy lines. 30% less detection radius and +2 sight radius.<br/>"

[MusashiCombatives X2AbilityTemplate]
LocFriendlyName="Combatives"
LocLongDescription="You may parry melee attacks and counterattack with your melee weapon. Also gain +<ABILITY:COMBATIVES_DODGE_LW/> dodge."
LocHelpText="You may parry melee attacks and counterattack with your melee weapon."
LocFlyOverText="Combatives"
LocPromotionPopupText="<Bullet/> You are very likely to parry the first melee attack against you in a turn and counterattack with your melee weapon.<br/><Bullet/> Soldier also gains <ABILITY:COMBATIVES_DODGE_LW/> dodge."

[MusashiWhirlwind X2AbilityTemplate]
LocFriendlyName="Whirlwind"
LocLongDescription="If you hit with a melee attack during your turn, gain a bonus move."
LocHelpText="Gain one bonus move action after a successful melee attack."
LocFlyOverText="Whirlwind"
LocPromotionPopupText="<Bullet/> A soldier can only gain one move per turn with this ability.<br/><Bullet/> Cannot be employed if Reaper is active.<br/>"

[MusashiCloseCombatSpecialist X2AbilityTemplate]
LocFriendlyName="Close Combat Specialist"
LocFlyOverText="Close Combat Specialist"
LocLongDescription="During enemy turns, fire a free reaction shot with your primary weapon at any visible enemy within four tiles who moves or fires."
LocHelpText="During enemy turns, Fire a free reaction shot at any visible enemy within four tiles who moves or fires."
LocPromotionPopupText="<Bullet/> Will not trigger if soldier is concealed.<br/><Bullet/> You may shoot at each enemy with this ability once per turn.<br/><Bullet/> Each shot requires 2 ammo.<br/>""

[MusashiCloseCombatSpecialistAttack X2AbilityTemplate]
LocFriendlyName="Close Combat Specialist"
LocFlyOverText="Close Combat Specialist"
LocLongDescription="During enemy turns, fire a free reaction shot with your primary weapon at any visible enemy within four tiles who moves or fires."
LocHelpText="During enemy turns, Fire a free reaction shot at any visible enemy within four tiles who moves or fires."
LocPromotionPopupText="<Bullet/> Will not trigger if soldier is concealed.<br/><Bullet/> You may shoot at each enemy with this ability once per turn.<br/><Bullet/> Each shot requires 2 ammo.<br/>""

[MusashiGunslinger X2AbilityTemplate]
LocFriendlyName="Gunslinger"
LocFlyOverText="Gunslinger"
LocLongDescription="Take a reaction shot with your pistol against any enemy that moves or attacks within 12 tiles and a wide cone of fire."
LocHelpText="Enhanced pistol overwatch in a cone of fire."
LocPromotionPopupText="<Bullet/> Range is 12 tiles.<br/><Bullet/> Three-turn cooldown.<br/>"

[Relocation X2AbilityTemplate]
LocFriendlyName="Relocation"
LocFlyOverText="Relocation"
LocLongDescription="Refunds one action point when you are revealed from concealment via your own action."
LocHelpText="Refunds one action point when you are revealed from concealment via your own action."
LocPromotionPopupText="<Bullet/> Refunds one action point when you are revealed from concealment via your own action.<br/><Bullet/> Only applies to actions taken during your turn.<br/><Bullet/> Does not activate when using abilities that do not cost an action point.<br/>"

[ArtOfWar X2AbilityTemplate]
LocFriendlyName="Art of War"
LocFlyOverText="Art of War"
LocLongDescription="Gain 3 aim for each enemy you can see, up to a maximum of 15 aim."
LocHelpText="Gain 3 aim for each enemy you can see, up to a maximum of 15 aim."
LocPromotionPopupText="<Bullet/> Gain 3 aim for each living enemy you can see, up to a maximum of 15 aim.<br/><Bullet/> Units visible at squadsight ranges do not confer bonus.<br/>"

[QuickDrawPrimary X2AbilityTemplate]
LocFriendlyName="Quickdraw"
LocLongDescription="Firing your <Ability:PrimaryWeaponName/> with your first action no longer ends your turn."
LocHelpText="Firing your <Ability:PrimaryWeaponName/> with your first action no longer ends your turn."
LocFlyOverText="Quickdraw"
LocPromotionPopupText="<Bullet/> Quickdraw is a fundamental <Ability:PrimaryWeaponName/> ability, as it allows the <Ability:ClassName/> to spread their fire around to different targets in the same turn.<br/>"
